STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_cm33.h
#define BSEC_NS                             ((BSEC_TypeDef *) BSEC_BASE_NS)
#define IWDG1_NS                            ((IWDG_TypeDef *) IWDG1_BASE_NS)
#define IWDG2_NS                            ((IWDG_TypeDef *) IWDG2_BASE_NS)
#define IWDG3_NS                            ((IWDG_TypeDef *) IWDG3_BASE_NS)
#define IWDG4_NS                            ((IWDG_TypeDef *) IWDG4_BASE_NS)
#define WWDG1_NS                            ((WWDG_TypeDef *) WWDG1_BASE_NS)
#define VREFBUF_NS                          ((VREFBUF_TypeDef *) VREFBUF_BASE_NS)
#define DTS_NS                              ((DTS_TypeDef *) DTS_BASE_NS)
#define SERC_NS                             ((SERC_TypeDef *) SERC_BASE_NS)
#define HDP_NS                              ((HDP_TypeDef *) HDP_BASE_NS)

#define RCC_NS                              ((RCC_TypeDef *) RCC_BASE_NS)
#define PWR_NS                              ((PWR_TypeDef *) PWR_BASE_NS)
#define EXTI1_NS                            ((EXTI_TypeDef *) EXTI1_BASE_NS)
#define EXTI1_C1_NS                         ((EXTI_Core_TypeDef *) EXTI1_C1_BASE_NS)
#define EXTI1_C2_NS                         ((EXTI_Core_TypeDef *) EXTI1_C2_BASE_NS)
#define SYSCFG_NS                           ((SYSCFG_TypeDef *) SYSCFG_BASE_NS)
#define GPIOA_NS                            ((GPIO_TypeDef *) GPIOA_BASE_NS)
#define GPIOB_NS                            ((GPIO_TypeDef *) GPIOB_BASE_NS)
#define GPIOC_NS                            ((GPIO_TypeDef *) GPIOC_BASE_NS)
#define GPIOD_NS                            ((GPIO_TypeDef *) GPIOD_BASE_NS)
#define GPIOE_NS                            ((GPIO_TypeDef *) GPIOE_BASE_NS)
#define GPIOF_NS                            ((GPIO_TypeDef *) GPIOF_BASE_NS)
#define GPIOG_NS                            ((GPIO_TypeDef *) GPIOG_BASE_NS)
#define GPIOH_NS                            ((GPIO_TypeDef *) GPIOH_BASE_NS)
#define GPIOI_NS                            ((GPIO_TypeDef *) GPIOI_BASE_NS)
#define GPIOJ_NS                            ((GPIO_TypeDef *) GPIOJ_BASE_NS)
#define GPIOK_NS                            ((GPIO_TypeDef *) GPIOK_BASE_NS)

#define RTC_NS                              ((RTC_TypeDef *) RTC_BASE_NS)
#define TAMP_NS                             ((TAMP_TypeDef *) TAMP_BASE_NS)
#define SPI8_NS                             ((SPI_TypeDef *) SPI8_BASE_NS)
#define LPUART1_NS                          ((USART_TypeDef *) LPUART1_BASE_NS)
#define I2C8_NS                             ((I2C_TypeDef *) I2C8_BASE_NS)
#define LPTIM3_NS                           ((LPTIM_TypeDef *) LPTIM3_BASE_NS)
#define LPTIM4_NS                           ((LPTIM_TypeDef *) LPTIM4_BASE_NS)
#define LPTIM5_NS                           ((LPTIM_TypeDef *) LPTIM5_BASE_NS)
#define I3C4_NS                             ((I3C_TypeDef *) I3C4_BASE_NS)
#define IWDG5_NS                            ((IWDG_TypeDef *) IWDG5_BASE_NS)
#define WWDG2_NS                            ((WWDG_TypeDef *) WWDG2_BASE_NS)

#define GPIOZ_NS                            ((GPIO_TypeDef *) GPIOZ_BASE_NS)
#define LPDMA_NS                            ((DMA_TypeDef *) LPDMA_BASE_NS)
#define EXTI2_NS                            ((EXTI_TypeDef *) EXTI2_BASE_NS)
#define EXTI2_C1_NS                         ((EXTI_Core_TypeDef *) EXTI2_C1_BASE_NS)
#define EXTI2_C2_NS                         ((EXTI_Core_TypeDef *) EXTI2_C2_BASE_NS)
#define EXTI2_C3_NS                         ((EXTI_Core_TypeDef *) EXTI2_C3_BASE_NS)
#define HSEM_NS                             ((HSEM_TypeDef *) HSEM_BASE_NS)
#define HSEM_COMMON_NS                      ((HSEM_Common_TypeDef *) (HSEM_BASE_NS + 0x110UL))
#define IPCC2_NS                            ((IPCC_TypeDef *) IPCC2_BASE_NS)
#define IPCC2_C1_NS                         ((IPCC_CommonTypeDef *) IPCC2_C1_BASE_NS)
#define IPCC2_C2_NS                         ((IPCC_CommonTypeDef *) IPCC2_C2_BASE_NS)

#define LPDMA_Channel0_NS                   ((DMA_Channel_TypeDef *) LPDMA_Channel0_BASE_NS)
#define LPDMA_Channel1_NS                   ((DMA_Channel_TypeDef *) LPDMA_Channel1_BASE_NS)
#define LPDMA_Channel2_NS                   ((DMA_Channel_TypeDef *) LPDMA_Channel2_BASE_NS)
#define LPDMA_Channel3_NS                   ((DMA_Channel_TypeDef *) LPDMA_Channel3_BASE_NS)

#define DSI_NS                              ((DSI_TypeDef *) DSI_BASE_NS)
#define LTDC_NS                             ((LTDC_TypeDef *) LTDC_BASE_NS)
#define LTDC_Layer1_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer1_BASE_NS)
#define LTDC_Layer2_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer2_BASE_NS)
#define LTDC_Layer3_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer3_BASE_NS)
#define CSI_NS                              ((CSI_TypeDef *) CSI_BASE_NS)
#define DCMIPP_NS                           ((DCMIPP_TypeDef *) DCMIPP_BASE_NS)
#define DDRC_NS                             ((DDRC_TypeDef *) DDRC_BASE_NS)
#define DDRDBG_NS                           ((DDRDBG_TypeDef *) DDRDBG_BASE_NS)
#define DDRPERFM_NS                         ((DDRPERFM_TypeDef *) DDRPERFM_BASE_NS)
#define LVDS_NS                             ((LVDS_TypeDef *) LVDS_BASE_NS)
#define STGENC_NS                           ((STGENC_TypeDef *) STGENC_BASE_NS)
#define STGENR_NS                           ((STGENR_TypeDef *) STGENR_BASE_NS)
#define GICV2M_NS                           ((GICV2M_TypeDef *) GICV2M_BASE_NS)
#define UCPD1_NS                            ((UCPD_TypeDef *) UCPD1_BASE_NS)
#define FMC_Bank1_R_NS                      ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_NS)
#define FMC_Bank1E_R_NS                     ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_NS)
#define FMC_Bank3_R_NS                      ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_NS)
#define FMC_Common_R_NS                     ((FMC_Common_TypeDef *) FMC_Common_R_BASE_NS)
#define SDMMC1_NS                           ((SDMMC_TypeDef *) SDMMC1_BASE_NS)
#define SDMMC2_NS                           ((SDMMC_TypeDef *) SDMMC2_BASE_NS)
#define SDMMC3_NS                           ((SDMMC_TypeDef *) SDMMC3_BASE_NS)
#define GPU_NS                              ((GPU_Host_InterfaceTypeDef *) GPU_BASE_NS)
#define ETH1_NS                             ((ETH_TypeDef *) ETH1_BASE_NS)
#define ETH2_NS                             ((ETH_TypeDef *) ETH2_BASE_NS)
#define USBH_OHCI_NS                        ((USBH_OHCI_TypeDef *) USBH_OHCI_BASE_NS)
#define USBH_EHCI_NS                        ((USBH_EHCI_TypeDef *) USBH_EHCI_BASE_NS)
#define USB3_NS                             ((USB3_TypeDef *) USB3DRD_BASE_NS)
#define CA35SYSCFG_NS                       ((CA35SYSCFG_TypeDef *) CA35SYSCFG_BASE_NS)

