STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_cm33.h
/******************  Bit definition for DSI_WRPCR1 register  ******************/
#define DSI_WRPCR1_PROP_Pos         (0U)
#define DSI_WRPCR1_PROP_Msk         (0x3FUL << DSI_WRPCR1_PROP_Pos)       /*!< 0x0000003F */
#define DSI_WRPCR1_PROP             DSI_WRPCR1_PROP_Msk                  /*!< Proportional Charge Pump: */
#define DSI_WRPCR1_GMP_Pos          (6U)
#define DSI_WRPCR1_GMP_Msk          (0x3UL << DSI_WRPCR1_GMP_Pos)         /*!< 0x000000C0 */
#define DSI_WRPCR1_GMP              DSI_WRPCR1_GMP_Msk                   /*!< Loop-Filter Resistance: */
#define DSI_WRPCR1_INT_Pos          (8U)
#define DSI_WRPCR1_INT_Msk          (0x3FUL << DSI_WRPCR1_INT_Pos)        /*!< 0x00003F00 */
#define DSI_WRPCR1_INT              DSI_WRPCR1_INT_Msk                   /*!< Integral of Charge Pump: */
#define DSI_WRPCR1_BIAS_Pos         (16U)
#define DSI_WRPCR1_BIAS_Msk         (0x7FUL << DSI_WRPCR1_BIAS_Pos)       /*!< 0x007F0000 */
#define DSI_WRPCR1_BIAS             DSI_WRPCR1_BIAS_Msk                  /*!< Charge Pump Bias: */
#define DSI_WRPCR1_VCO_Pos          (24U)
#define DSI_WRPCR1_VCO_Msk          (0xFUL << DSI_WRPCR1_VCO_Pos)         /*!< 0x0F000000 */
#define DSI_WRPCR1_VCO              DSI_WRPCR1_VCO_Msk                   /*!< VCO Operating Range: */
#define DSI_WRPCR1_ODF_Pos          (28U)
#define DSI_WRPCR1_ODF_Msk          (0x3UL << DSI_WRPCR1_ODF_Pos)         /*!< 0x30000000 */
#define DSI_WRPCR1_ODF              DSI_WRPCR1_ODF_Msk                   /*!< Output Division Factor : */

/******************  Bit definition for DSI_WRPCR2 register  ******************/
#define DSI_WRPCR2_SEL_Pos          (0U)
#define DSI_WRPCR2_SEL_Msk          (0x3UL << DSI_WRPCR2_SEL_Pos)         /*!< 0x00000003 */
#define DSI_WRPCR2_SEL              DSI_WRPCR2_SEL_Msk                   /*!< Output Selection for PLL Clock: */
#define DSI_WRPCR2_PLLEN_Pos        (8U)
#define DSI_WRPCR2_PLLEN_Msk        (0x1UL << DSI_WRPCR2_PLLEN_Pos)       /*!< 0x00000100 */
#define DSI_WRPCR2_PLLEN            DSI_WRPCR2_PLLEN_Msk                 /*!< PLL enable */
#define DSI_WRPCR2_UPD_Pos          (16U)
#define DSI_WRPCR2_UPD_Msk          (0x1UL << DSI_WRPCR2_UPD_Pos)         /*!< 0x00010000 */
#define DSI_WRPCR2_UPD              DSI_WRPCR2_UPD_Msk                   /*!< Update (copies) the PLL Shadow Registers to the effective PLL registers: */
#define DSI_WRPCR2_CLR_Pos          (24U)
#define DSI_WRPCR2_CLR_Msk          (0x1UL << DSI_WRPCR2_CLR_Pos)         /*!< 0x01000000 */
#define DSI_WRPCR2_CLR              DSI_WRPCR2_CLR_Msk                   /*!< Clears the PLL Shadow Registers to their reset value: */
#define DSI_WRPCR2_FPLLLOCK_Pos     (28U)
#define DSI_WRPCR2_FPLLLOCK_Msk     (0x1UL << DSI_WRPCR2_FPLLLOCK_Pos)    /*!< 0x10000000 */
#define DSI_WRPCR2_FPLLLOCK         DSI_WRPCR2_FPLLLOCK_Msk              /*!< Force PLL lock signal */

/******************  Bit definition for DSI_WRPSR0 register  ******************/
#define DSI_WRPSR0_IDF_Pos          (0U)
#define DSI_WRPSR0_IDF_Msk          (0xFUL << DSI_WRPSR0_IDF_Pos)         /*!< 0x0000000F */
#define DSI_WRPSR0_IDF              DSI_WRPSR0_IDF_Msk                   /*!< Shadow value of: PLL Input Division ratio: */
#define DSI_WRPSR0_NDIV_Pos         (4U)
#define DSI_WRPSR0_NDIV_Msk         (0x3FFUL << DSI_WRPSR0_NDIV_Pos)      /*!< 0x00003FF0 */
#define DSI_WRPSR0_NDIV             DSI_WRPSR0_NDIV_Msk                  /*!< Shadow value of: PLL InLoop Division ratio: */
#define DSI_WRPSR0_PSC_Pos          (16U)
#define DSI_WRPSR0_PSC_Msk          (0x1UL << DSI_WRPSR0_PSC_Pos)         /*!< 0x00010000 */
#define DSI_WRPSR0_PSC              DSI_WRPSR0_PSC_Msk                   /*!< PLL Shadow Control: */

/******************  Bit definition for DSI_WRPSR1 register  ******************/
#define DSI_WRPSR1_PROP_Pos         (0U)
#define DSI_WRPSR1_PROP_Msk         (0x3FUL << DSI_WRPSR1_PROP_Pos)       /*!< 0x0000003F */
#define DSI_WRPSR1_PROP             DSI_WRPSR1_PROP_Msk                  /*!< Proportional Charge Pump: */
#define DSI_WRPSR1_GMP_Pos          (6U)
#define DSI_WRPSR1_GMP_Msk          (0x3UL << DSI_WRPSR1_GMP_Pos)         /*!< 0x000000C0 */
#define DSI_WRPSR1_GMP              DSI_WRPSR1_GMP_Msk                   /*!< GMP Loop-Filter Resistance: */
#define DSI_WRPSR1_INT_Pos          (8U)
#define DSI_WRPSR1_INT_Msk          (0x3FUL << DSI_WRPSR1_INT_Pos)        /*!< 0x00003F00 */
#define DSI_WRPSR1_INT              DSI_WRPSR1_INT_Msk                   /*!< Charge Pump Integral: */
#define DSI_WRPSR1_BIAS_Pos         (16U)
#define DSI_WRPSR1_BIAS_Msk         (0x7FUL << DSI_WRPSR1_BIAS_Pos)       /*!< 0x007F0000 */
#define DSI_WRPSR1_BIAS             DSI_WRPSR1_BIAS_Msk                  /*!< Charge Pump Bias: */
#define DSI_WRPSR1_VCO_Pos          (24U)
#define DSI_WRPSR1_VCO_Msk          (0xFUL << DSI_WRPSR1_VCO_Pos)         /*!< 0x0F000000 */
#define DSI_WRPSR1_VCO              DSI_WRPSR1_VCO_Msk                   /*!< VCO Operating Range: */
#define DSI_WRPSR1_ODF_Pos          (28U)
#define DSI_WRPSR1_ODF_Msk          (0x3UL << DSI_WRPSR1_ODF_Pos)         /*!< 0x30000000 */
#define DSI_WRPSR1_ODF              DSI_WRPSR1_ODF_Msk                   /*!< Output Division Factor : */

/*******************  Bit definition for DSI_WCRB register  *******************/
#define DSI_WCRB_LTDCEN_Pos         (2U)
#define DSI_WCRB_LTDCEN_Msk         (0x1UL << DSI_WCRB_LTDCEN_Pos)        /*!< 0x00000004 */
#define DSI_WCRB_LTDCEN             DSI_WCRB_LTDCEN_Msk                  /*!< LTDC enable */

/******************  Bit definition for DSI_HWCFGR register  ******************/
#define DSI_HWCFGR_TECHNO_Pos       (0U)
#define DSI_HWCFGR_TECHNO_Msk       (0xFUL << DSI_HWCFGR_TECHNO_Pos)      /*!< 0x0000000F */
#define DSI_HWCFGR_TECHNO           DSI_HWCFGR_TECHNO_Msk                /*!< Technology */
#define DSI_HWCFGR_FIFOSIZE_Pos     (4U)
#define DSI_HWCFGR_FIFOSIZE_Msk     (0xFFFUL << DSI_HWCFGR_FIFOSIZE_Pos)  /*!< 0x0000FFF0 */
#define DSI_HWCFGR_FIFOSIZE         DSI_HWCFGR_FIFOSIZE_Msk              /*!< FIFO size */
#define DSI_HWCFGR_LANES_Pos        (16U)
#define DSI_HWCFGR_LANES_Msk        (0xFUL << DSI_HWCFGR_LANES_Pos)       /*!< 0x000F0000 */
#define DSI_HWCFGR_LANES            DSI_HWCFGR_LANES_Msk                 /*!< Amount of DSI DataLanes per Link (excluding the ClockLane thus). */
#define DSI_HWCFGR_LINKS_Pos        (20U)
#define DSI_HWCFGR_LINKS_Msk        (0xFUL << DSI_HWCFGR_LINKS_Pos)       /*!< 0x00F00000 */
#define DSI_HWCFGR_LINKS            DSI_HWCFGR_LINKS_Msk                 /*!< Amount of DSI PHY Linkssize */

/*******************  Bit definition for DSI_VERR register  *******************/
#define DSI_VERR_MINREV_Pos         (0U)
#define DSI_VERR_MINREV_Msk         (0xFUL << DSI_VERR_MINREV_Pos)        /*!< 0x0000000F */
#define DSI_VERR_MINREV             DSI_VERR_MINREV_Msk                  /*!< Minor revision */
#define DSI_VERR_MAJREV_Pos         (4U)
#define DSI_VERR_MAJREV_Msk         (0xFUL << DSI_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define DSI_VERR_MAJREV             DSI_VERR_MAJREV_Msk                  /*!< Major revision */

