STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_cm33.h
/******************  Bit definition for DTS_TS_ISR register  ******************/
#define DTS_TS_ISR_TS0_IRQ_STATUS_Pos               (0U)
#define DTS_TS_ISR_TS0_IRQ_STATUS_Msk               (0x1UL << DTS_TS_ISR_TS0_IRQ_STATUS_Pos)              /*!< 0x00000001 */
#define DTS_TS_ISR_TS0_IRQ_STATUS                   DTS_TS_ISR_TS0_IRQ_STATUS_Msk                        /*!< TS0 IRQ status bit after masking */
#define DTS_TS_ISR_TS1_IRQ_STATUS_Pos               (1U)
#define DTS_TS_ISR_TS1_IRQ_STATUS_Msk               (0x1UL << DTS_TS_ISR_TS1_IRQ_STATUS_Pos)              /*!< 0x00000002 */
#define DTS_TS_ISR_TS1_IRQ_STATUS                   DTS_TS_ISR_TS1_IRQ_STATUS_Msk                        /*!< TS1 IRQ status bit after masking */

/**************  Bit definition for DTS_PVTTMRRAW_ISR register  ***************/
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Pos    (0U)
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Msk    (0x1UL << DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Pos)   /*!< 0x00000001 */
#define DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS        DTS_PVTTMRRAW_ISR_TMR_IRQ_RAW_STATUS_Msk             /*!< TMR IRQ status bit before masking */

/****************  Bit definition for DTS_TSRAW_ISR register  *****************/
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Pos        (0U)
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Msk        (0x1UL << DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Pos)       /*!< 0x00000001 */
#define DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS            DTS_TSRAW_ISR_TS0_IRQ_RAW_STATUS_Msk                 /*!< TS0 IRQ status bit before masking */
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Pos        (1U)
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Msk        (0x1UL << DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Pos)       /*!< 0x00000002 */
#define DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS            DTS_TSRAW_ISR_TS1_IRQ_RAW_STATUS_Msk                 /*!< TS1 IRQ status bit before masking */

/***************  Bit definition for DTS_TSCCLKSYNTHR register  ***************/
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Pos           (0U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Msk           (0xFFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Pos)         /*!< 0x000000FF */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_LO               DTS_TSCCLKSYNTHR_CLK_SYNTH_LO_Msk                    /*!< Synthesized clk_ts low period */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Pos           (8U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Msk           (0xFFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Pos)         /*!< 0x0000FF00 */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HI               DTS_TSCCLKSYNTHR_CLK_SYNTH_HI_Msk                    /*!< Synthesized clk_ts high period */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Pos         (16U)
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Msk         (0xFUL << DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Pos)        /*!< 0x000F0000 */
#define DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD             DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Msk                  /*!< SDA master-to-SDA slave output hold delay/SDA slave-to-SDA master input setup delay */
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Pos            (24U)
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Msk            (0x1UL << DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Pos)           /*!< 0x01000000 */
#define DTS_TSCCLKSYNTHR_CLK_SYTH_EN                DTS_TSCCLKSYNTHR_CLK_SYTH_EN_Msk                     /*!< Synthesized clk_ts enable bit */

/*************  Bit definition for DTS_TSCSDIFDISABLER register  **************/
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Pos    (0U)
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Msk    (0x1UL << DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Pos)   /*!< 0x00000001 */
#define DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE        DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE_Msk             /*!< TS0 serial data interface (SDIF) disable bit */
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Pos    (1U)
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Msk    (0x1UL << DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Pos)   /*!< 0x00000002 */
#define DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE        DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE_Msk             /*!< TS1 serial data interface (SDIF) disable bit */

/****************  Bit definition for DTS_TSCSDIF_SR register  ****************/
#define DTS_TSCSDIF_SR_SDIF_BUSY_Pos                (0U)
#define DTS_TSCSDIF_SR_SDIF_BUSY_Msk                (0x1UL << DTS_TSCSDIF_SR_SDIF_BUSY_Pos)               /*!< 0x00000001 */
#define DTS_TSCSDIF_SR_SDIF_BUSY                    DTS_TSCSDIF_SR_SDIF_BUSY_Msk                         /*!< SDIF busy flag */
#define DTS_TSCSDIF_SR_SDIF_LOCK_Pos                (1U)
#define DTS_TSCSDIF_SR_SDIF_LOCK_Msk                (0x1UL << DTS_TSCSDIF_SR_SDIF_LOCK_Pos)               /*!< 0x00000002 */
#define DTS_TSCSDIF_SR_SDIF_LOCK                    DTS_TSCSDIF_SR_SDIF_LOCK_Msk                         /*!< SDIF locked flag */

/****************  Bit definition for DTS_TSCSDIF_CR register  ****************/
#define DTS_TSCSDIF_CR_SDIF_WDATA_Pos               (0U)
#define DTS_TSCSDIF_CR_SDIF_WDATA_Msk               (0xFFFFFFUL << DTS_TSCSDIF_CR_SDIF_WDATA_Pos)         /*!< 0x00FFFFFF */
#define DTS_TSCSDIF_CR_SDIF_WDATA                   DTS_TSCSDIF_CR_SDIF_WDATA_Msk                        /*!< Serial interface write data */
#define DTS_TSCSDIF_CR_SDIF_ADDR_Pos                (24U)
#define DTS_TSCSDIF_CR_SDIF_ADDR_Msk                (0x7UL << DTS_TSCSDIF_CR_SDIF_ADDR_Pos)               /*!< 0x07000000 */
#define DTS_TSCSDIF_CR_SDIF_ADDR                    DTS_TSCSDIF_CR_SDIF_ADDR_Msk                         /*!< Serial interface register address */
#define DTS_TSCSDIF_CR_SDIF_WRN_Pos                 (27U)
#define DTS_TSCSDIF_CR_SDIF_WRN_Msk                 (0x1UL << DTS_TSCSDIF_CR_SDIF_WRN_Pos)                /*!< 0x08000000 */
#define DTS_TSCSDIF_CR_SDIF_WRN                     DTS_TSCSDIF_CR_SDIF_WRN_Msk                          /*!< Serial interface write/no read control bit */
#define DTS_TSCSDIF_CR_SDIF_PROG_Pos                (31U)
#define DTS_TSCSDIF_CR_SDIF_PROG_Msk                (0x1UL << DTS_TSCSDIF_CR_SDIF_PROG_Pos)               /*!< 0x80000000 */
#define DTS_TSCSDIF_CR_SDIF_PROG                    DTS_TSCSDIF_CR_SDIF_PROG_Msk                         /*!< Serial interface program request */

/***************  Bit definition for DTS_TSCSDIFHALTR register  ***************/
#define DTS_TSCSDIFHALTR_SDIF_STOP_Pos              (0U)
#define DTS_TSCSDIFHALTR_SDIF_STOP_Msk              (0x1UL << DTS_TSCSDIFHALTR_SDIF_STOP_Pos)             /*!< 0x00000001 */
#define DTS_TSCSDIFHALTR_SDIF_STOP                  DTS_TSCSDIFHALTR_SDIF_STOP_Msk                       /*!< Serial data interface (SDIF) stop  */

/***************  Bit definition for DTS_TSCSDIF_CFGR register  ***************/
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Pos           (0U)
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Msk           (0x3UL << DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Pos)          /*!< 0x00000003 */
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT               DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Msk                    /*!< Serial data interface (SDIF) programming inhibit  */

