STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_cm33.h
/*******************  Bit definition for I3C_RDWR register  *******************/
#define I3C_RDWR_RDBx_Pos            (0U)
#define I3C_RDWR_RDBx_Msk            (0xFFFFFFFFUL << I3C_RDWR_RDBx_Pos)  /*!< 0xFFFFFFFF */
#define I3C_RDWR_RDBx                I3C_RDWR_RDBx_Msk                    /*!< 32-bit received data */
#define I3C_RDWR_RDB0_Pos            (0U)
#define I3C_RDWR_RDB0_Msk            (0xFFUL << I3C_RDWR_RDB0_Pos)          /*!< 0x000000FF */
#define I3C_RDWR_RDB0                I3C_RDWR_RDB0_Msk                     /*!< 8-bit received data (earliest byte on I3C bus) */
#define I3C_RDWR_RDB1_Pos            (8U)
#define I3C_RDWR_RDB1_Msk            (0xFFUL << I3C_RDWR_RDB1_Pos)          /*!< 0x0000FF00 */
#define I3C_RDWR_RDB1                I3C_RDWR_RDB1_Msk                     /*!< 8-bit received data (next byte after RDB0 on I3C bus) */
#define I3C_RDWR_RDB2_Pos            (16U)
#define I3C_RDWR_RDB2_Msk            (0xFFUL << I3C_RDWR_RDB2_Pos)          /*!< 0x00FF0000 */
#define I3C_RDWR_RDB2                I3C_RDWR_RDB2_Msk                     /*!< 8-bit received data (next byte after RDB1 on I3C bus) */
#define I3C_RDWR_RDB3_Pos            (24U)
#define I3C_RDWR_RDB3_Msk            (0xFFUL << I3C_RDWR_RDB3_Pos)          /*!< 0xFF000000 */
#define I3C_RDWR_RDB3                I3C_RDWR_RDB3_Msk                     /*!< 8-bit received data (latest byte on I3C bus) */

/*******************  Bit definition for I3C_TDR register  ********************/
#define I3C_TDR_TDB0_Pos             (0U)
#define I3C_TDR_TDB0_Msk             (0xFFUL << I3C_TDR_TDB0_Pos)           /*!< 0x000000FF */
#define I3C_TDR_TDB0                 I3C_TDR_TDB0_Msk                      /*!< 8-bit data to transmit on I3C bus */

/*******************  Bit definition for I3C_TDWR register  *******************/
#define I3C_TDWR_TDBx_Pos            (0U)
#define I3C_TDWR_TDBx_Msk            (0xFFFFFFFFUL << I3C_TDWR_TDBx_Pos)   /*!< 0xFFFFFFFF */
#define I3C_TDWR_TDBx                I3C_TDWR_TDBx_Msk                     /*!< 32-bit transmit data */
#define I3C_TDWR_TDB0_Pos            (0U)
#define I3C_TDWR_TDB0_Msk            (0xFFUL << I3C_TDWR_TDB0_Pos)          /*!< 0x000000FF */
#define I3C_TDWR_TDB0                I3C_TDWR_TDB0_Msk                     /*!< 8-bit transmit data (earliest byte on I3C bus) */
#define I3C_TDWR_TDB1_Pos            (8U)
#define I3C_TDWR_TDB1_Msk            (0xFFUL << I3C_TDWR_TDB1_Pos)          /*!< 0x0000FF00 */
#define I3C_TDWR_TDB1                I3C_TDWR_TDB1_Msk                     /*!< 8-bit transmit data (next byte after TDB0[7:0] on I3C bus) */
#define I3C_TDWR_TDB2_Pos            (16U)
#define I3C_TDWR_TDB2_Msk            (0xFFUL << I3C_TDWR_TDB2_Pos)          /*!< 0x00FF0000 */
#define I3C_TDWR_TDB2                I3C_TDWR_TDB2_Msk                     /*!< 8-bit transmit data (next byte after TDB1[7:0] on I3C bus) */
#define I3C_TDWR_TDB3_Pos            (24U)
#define I3C_TDWR_TDB3_Msk            (0xFFUL << I3C_TDWR_TDB3_Pos)          /*!< 0xFF000000 */
#define I3C_TDWR_TDB3                I3C_TDWR_TDB3_Msk                     /*!< 8-bit transmit data (latest byte on I3C bus) */

/******************  Bit definition for I3C_IBIDR register  *******************/
#define I3C_IBIDR_IBIDBx_Pos         (0U)
#define I3C_IBIDR_IBIDBx_Msk         (0xFFFFFFFFUL << I3C_IBIDR_IBIDBx_Pos)/*!< 0xFFFFFFFF */
#define I3C_IBIDR_IBIDBx             I3C_IBIDR_IBIDBx_Msk                  /*!< 32-bit IBI payload data */
#define I3C_IBIDR_IBIDB0_Pos         (0U)
#define I3C_IBIDR_IBIDB0_Msk         (0xFFUL << I3C_IBIDR_IBIDB0_Pos)       /*!< 0x000000FF */
#define I3C_IBIDR_IBIDB0             I3C_IBIDR_IBIDB0_Msk                  /*!< 8-bit IBI payload data (earliest byte on I3C bus, i */
#define I3C_IBIDR_IBIDB1_Pos         (8U)
#define I3C_IBIDR_IBIDB1_Msk         (0xFFUL << I3C_IBIDR_IBIDB1_Pos)       /*!< 0x0000FF00 */
#define I3C_IBIDR_IBIDB1             I3C_IBIDR_IBIDB1_Msk                  /*!< 8-bit IBI payload data (next byte on I3C bus after IBIDB0[7:0]) */
#define I3C_IBIDR_IBIDB2_Pos         (16U)
#define I3C_IBIDR_IBIDB2_Msk         (0xFFUL << I3C_IBIDR_IBIDB2_Pos)       /*!< 0x00FF0000 */
#define I3C_IBIDR_IBIDB2             I3C_IBIDR_IBIDB2_Msk                  /*!< 8-bit IBI payload data (next byte on I3C bus after IBIDB1[7:0]) */
#define I3C_IBIDR_IBIDB3_Pos         (24U)
#define I3C_IBIDR_IBIDB3_Msk         (0xFFUL << I3C_IBIDR_IBIDB3_Pos)       /*!< 0xFF000000 */
#define I3C_IBIDR_IBIDB3             I3C_IBIDR_IBIDB3_Msk                  /*!< 8-bit IBI payload data (latest byte on I3C bus) */

/******************  Bit definition for I3C_TGTTDR register  ******************/
#define I3C_TGTTDR_TGTTDCNT_Pos      (0U)
#define I3C_TGTTDR_TGTTDCNT_Msk      (0xFFFFUL << I3C_TGTTDR_TGTTDCNT_Pos)  /*!< 0x0000FFFF */
#define I3C_TGTTDR_TGTTDCNT          I3C_TGTTDR_TGTTDCNT_Msk               /*!< transmit data counter, in bytes (when I3C is configured as target) */
#define I3C_TGTTDR_PRELOAD_Pos       (16U)
#define I3C_TGTTDR_PRELOAD_Msk       (0x1UL << I3C_TGTTDR_PRELOAD_Pos)      /*!< 0x00010000 */
#define I3C_TGTTDR_PRELOAD           I3C_TGTTDR_PRELOAD_Msk                /*!< preload of the TX-FIFO (when I3C is configured as target) */

/********************  Bit definition for I3C_SR register  ********************/
#define I3C_SR_XDCNT_Pos             (0U)
#define I3C_SR_XDCNT_Msk             (0xFFFFUL << I3C_SR_XDCNT_Pos)         /*!< 0x0000FFFF */
#define I3C_SR_XDCNT                 I3C_SR_XDCNT_Msk                      /*!< data counter */
#define I3C_SR_ABT_Pos               (17U)
#define I3C_SR_ABT_Msk               (0x1UL << I3C_SR_ABT_Pos)              /*!< 0x00020000 */
#define I3C_SR_ABT                   I3C_SR_ABT_Msk                        /*!< a private read message is completed/aborted prematurely by the target (when the I3C is acting as co */
#define I3C_SR_DIR_Pos               (18U)
#define I3C_SR_DIR_Msk               (0x1UL << I3C_SR_DIR_Pos)              /*!< 0x00040000 */
#define I3C_SR_DIR                   I3C_SR_DIR_Msk                        /*!< message direction */
#define I3C_SR_MID_Pos               (24U)
#define I3C_SR_MID_Msk               (0xFFUL << I3C_SR_MID_Pos)             /*!< 0xFF000000 */
#define I3C_SR_MID                   I3C_SR_MID_Msk                        /*!< message identifier/counter of a given frame (when the I3C is acting as controller) */

